const ChaosCodes = {
  /* 系统内部错误 */
  10000: '未知错误，请稍候再试',
  10001: '系统配置丢失',
  10002: '处理程序出错',
  10003: '获取原始数据失败',
  10004: '解密 XML 失败',
  10005: '解码 XML 失败',
  10006: '保存授权方信息失败',
  10007: '获取授权方刷新令牌失败',
  10008: '获取授权方访问令牌失败',
  10009: '保存到数据库失败',
  10010: '发送请求失败',
  10011: '收到了无效的响应内容',
  10012: '发送 GET 请求失败',
  10013: '发送 POST 请求失败',
  10014: '检查 SQL 注入失败',
  10015: '发送 GET ( Json ) 请求失败',
  10016: '获取 OffcnMIS 口令码失败',
  10017: '将 Json Map 编码为字符串时发生错误',
  10018: '将字符串解码为 Json Map 时发生错误',
  10019: '将字符串进行 Base64 编码时发生错误',
  10020: '将字符串进行 Base64 解码时发生错误',
  10021: '将字符串进行 RSA 加密时发生错误',
  10022: '将字符串进行 RSA 解密时发生错误',
  10023: '从上下文中获取会话信息时发生错误',

  /* 数据不合规 */
  11000: '数据不合规',
  11001: 'Json 数据不合规',
  11002: '表名不合规',
  11003: '手机号不合规',
  11004: '链接中的参数不合规',
  11005: '参数不合规',
  11006: '未通过 SQL 注入检查',

  /* 数据不存在 */
  12000: '数据不存在',
  12001: '表不存在',
  12002: '页面不存在',
  12003: '轮播图不存在',
  12004: '课程不存在',

  /* 授权错误 */
  13000: '未授权',
  13001: '未授权 ( 跨域 )',
  13002: '用户已经被禁用或不存在',
  13003: '密码不匹配',
  13004: '用户在24小时内登录失败超过5次',
  13005: '会话已过期',
  13006: 'OffcnMIS 口令码已过期',
  13007: '用户没有此操作的权限',

  /* 操作错误 */
  14000: '操作错误',
  14001: '目标用户组中还存在其他子分组',
  14002: '目标用户组中还存在其他用户',
  14003: '重复的用户名',
  14004: '当前用户组已经创建过页面',
  14005: '超过轮播图创建上限',
  14006: '已经向您发送过验证码',
  14007: '验证码已过期',
  14008: '验证码不正确',

  /* 需要忽略的状态码 ( 不弹出提示 ) */
  IgnoreCodes: [
    12002,
    12003,
    12004,
  ]
}

console.warn('Chaos > 代码表模块 ( codes.js ) 中定义了全局常量 [ ChaosCodes ] ，请注意不要覆盖！')
